src/Documents/ДокументКадровогоЭДО/ДокументКадровогоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументКадровогоЭДО</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайлПечатнойФормы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДокумента</name>
    <type>
      <types>DefinedType.ОбъектСПечатнымиФормами</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭлектронныйДокумент</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОснованиеДокумента</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявкиКабинетСотрудника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДокумента</name>
    <type>
      <types>EnumRef.КатегорииДокументовКадровогоЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>АПК:58 Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеДокумента</name>
    <type>
      <types>EnumRef.СодержимоеДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодписанСотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДокументаСоответствуетТребованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяТаблица</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПодписания</name>
    <type>
      <types>EnumRef.ВариантыПодписанияДокументовКЭДО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеПодписанты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/КатегорииДокументовКадровогоЭДО/КатегорииДокументовКадровогоЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДокументовКадровогоЭДО</name>
  <enumValues>
    <name>РасчетныйЛисток</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеСотрудника</name>
  </enumValues>
  <enumValues>
    <name>КадровыйДокумент</name>
  </enumValues>
  <enumValues>
    <name>СправкаСотруднику</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ДокументКадровогоЭДО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		Если ДополнительныеСвойства.Свойство("СсылкаНового") Тогда
			СсылкаНового = ДополнительныеСвойства.СсылкаНового;
			УстановитьСсылкуНового(СсылкаНового);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
			ИдентификаторДокумента = Строка(ЭлектронныйДокумент.УникальныйИдентификатор());
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Ответственный) Тогда
			
			ЗаполняемыеЗначения = Новый Структура("Ответственный");
			ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаполняемыеЗначения);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КодДокументаКадровогоМероприятия) Тогда
			КодДокументаКадровогоМероприятия = КадровыйЭДОПовтИсп.КодКадровогоДокументаПоУмолчанию();
		КонецЕсли;
		
		Если ПустаяСтрока(Расширение) И ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
			УстановитьПривилегированныйРежим(Истина);
			ДополнительныеПараметры = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
			ДополнительныеПараметры.ПолучатьСсылкуНаДвоичныеДанные = Ложь;
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(ЭлектронныйДокумент, ДополнительныеПараметры);
			Расширение = ДанныеФайла.Расширение;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
	Иначе
		Если ПометкаУдаления И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
			Если КатегорияДокумента = Перечисления.КатегорииДокументовКадровогоЭДО.РасчетныйЛисток
				И ИнтеграцияКабинетСотрудника.ФайлРасчетногоЛисткаОпубликован(Ссылка) Тогда
				
				ТекстСообщения = НСтр("ru = 'Не предусмотрено удаление файлов расчетных листов, их содержимое меняется при обновлении публикации.';
										|en = 'Payslip file deletion is not available. Payslips change upon the publication update.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
			ИначеЕсли Не Пользователи.ЭтоПолноправныйПользователь(, , Ложь)
				И Не ДополнительныеСвойства.Свойство("РазрешенаПометкаУдаления") Тогда
				
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Пометка на удаление объектов ""%1"" не предусмотрена';
						|en = 'Cannot mark the ""%1"" objects for deletion'"),
					Метаданные().Синоним);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
			Иначе
				Если ЭлектронныйДокумент <> Неопределено И
					ЭлектронныйДокумент.Метаданные() <> Метаданные.Документы.ДокументКадровогоЭДО Тогда
					
					Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйДокумент, "ПометкаУдаления") Тогда
						ОбъектФайла = ЭлектронныйДокумент.ПолучитьОбъект();
						ОбъектФайла.ДополнительныеСвойства.Вставить("УдалениеПечатныхФорм", Истина);
						ОбъектФайла.УстановитьПометкуУдаления(Истина);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ДополнительныеСвойства.Свойство("НеПроверятьЭлектронныйДокумент") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ЭлектронныйДокумент");
	КонецЕсли;
	
	Если Не ПроизвольнаяТаблица Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "НаименованиеДокумента");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
